chtMultiregionFoam/expt_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       29765;
    }
    minX
    {
        type            patch;
        nFaces          100;
        startFace       30065;
    }
    maxX
    {
        type            patch;
        nFaces          100;
        startFace       30165;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       30265;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       30565;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       30865;
    }
)

// ************************************************************************* //
